In [3]:
"""Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
Answer:- """
import pandas as pd
print("program")
series1=pd.Series([4,8,15,16, 23, 42])
print(series)

program
0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [20]:
""" Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.
Answer:-"""
print("program")
List1=[2,4,5,2,'Raman',23,90,89, 'gupta','Agrawal']
series2=pd.Series(List1)
print(series2)

program
0          2
1          4
2          5
3          2
4      Raman
5         23
6         90
7         89
8      gupta
9    Agrawal
dtype: object

In [26]:
"""Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.
Answer:- """
print("program")
lst=[['Alice',25,'female'],['Bob',30,'Male'],['Claire',27,'Female']]
df=pd.DataFrame(lst, columns=["Name", "Age", "Gender"], index=None)
df

program

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    Male
2  Claire   27  Female

In [25]:
"""Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
Answer:-DataFrame is a 2 dimensional labelled datastructure in python while series is a 1- dimensionale datastructre there is a index column to access the data in series which is also available in dataframe
"""

'Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.\nAnswer:-DataFrame is a 2 dimensional labelled datastructure in python while series is a 1- dimensionale datastructre there is a index column to access the data in series which is also available in dataframe\n'

In [33]:
"""Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?
Answer:- Functions are:- 
head()
tail()
dtypes()
"""
print("Example\n")
Head=df.head(2)
Tail= df.tail(2)
print(Head)
print(Tail)

Example

    Name  Age  Gender
0  Alice   25  female
1    Bob   30    Male
     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [34]:
"""Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Answer:-All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable. The length of a Series cannot be changed, but, for example, columns can be inserted into a DataFrame.
and panel is 3-D size mutable array"""

'Q6. Which of the following is mutable in nature Series, DataFrame, Panel?\nAnswer:-All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable. The length of a Series cannot be changed, but, for example, columns can be inserted into a DataFrame.\nand panel is 3-D size mutable array'

In [45]:
"""Q7. Create a DataFrame using multiple Series. Explain with an example.
Answer:-"""
print("Program")
data={"Name":pd.Series(["Raman","Dikhsa"]),"Age":pd.Series([19,18]), "year":pd.Series([3,2]) }
df=pd.DataFrame(data,  columns=["Name", "Age", "Year"])
df

Program

     Name  Age Year
0   Raman   19  NaN
1  Dikhsa   18  NaN